Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz1064dar169.h
extern volatile __SRCON0Hbits_t SRCON0Hbits __asm__ ("SRCON0H") __attribute__((section("sfrs"), address(0xBF8607C0)));
extern volatile uint32_t        SRCON0HCLR __attribute__((section("sfrs"),address(0xBF8607C4)));
extern volatile uint32_t        SRCON0HSET __attribute__((section("sfrs"),address(0xBF8607C8)));
extern volatile uint32_t        SRCON0HINV __attribute__((section("sfrs"),address(0xBF8607CC)));
#define SRCON1H SRCON1H
extern volatile uint32_t   SRCON1H __attribute__((section("sfrs"), address(0xBF8607D0)));
typedef struct {
  uint32_t SR1H0:1;
  uint32_t SR1H1:1;
  uint32_t SR1H2:1;
  uint32_t SR1H3:1;
  uint32_t SR1H4:1;
  uint32_t SR1H5:1;
  uint32_t SR1H6:1;
  uint32_t SR1H7:1;
  uint32_t SR1H8:1;
  uint32_t SR1H9:1;
  uint32_t SR1H10:1;
  uint32_t SR1H11:1;
  uint32_t SR1H12:1;
  uint32_t SR1H13:1;
  uint32_t SR1H14:1;
  uint32_t SR1H15:1;
} __SRCON1Hbits_t;
extern volatile __SRCON1Hbits_t SRCON1Hbits __asm__ ("SRCON1H") __attribute__((section("sfrs"), address(0xBF8607D0)));
extern volatile uint32_t        SRCON1HCLR __attribute__((section("sfrs"),address(0xBF8607D4)));
extern volatile uint32_t        SRCON1HSET __attribute__((section("sfrs"),address(0xBF8607D8)));
extern volatile uint32_t        SRCON1HINV __attribute__((section("sfrs"),address(0xBF8607DC)));
#define ANSELJ ANSELJ
extern volatile uint32_t   ANSELJ __attribute__((section("sfrs"), address(0xBF860800)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t ANSJ2:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELJbits_t;
extern volatile __ANSELJbits_t ANSELJbits __asm__ ("ANSELJ") __attribute__((section("sfrs"), address(0xBF860800)));
extern volatile uint32_t        ANSELJCLR __attribute__((section("sfrs"),address(0xBF860804)));
extern volatile uint32_t        ANSELJSET __attribute__((section("sfrs"),address(0xBF860808)));
extern volatile uint32_t        ANSELJINV __attribute__((section("sfrs"),address(0xBF86080C)));
#define TRISJ TRISJ
extern volatile uint32_t   TRISJ __attribute__((section("sfrs"), address(0xBF860810)));
typedef union {
  struct {
    uint32_t TRISJ0:1;
    uint32_t TRISJ1:1;
    uint32_t TRISJ2:1;
    uint32_t TRISJ3:1;
    uint32_t TRISJ4:1;
    uint32_t TRISJ5:1;
    uint32_t TRISJ6:1;
    uint32_t TRISJ7:1;
    uint32_t TRISJ8:1;
    uint32_t TRISJ9:1;
    uint32_t TRISJ10:1;
    uint32_t TRISJ11:1;
    uint32_t TRISJ12:1;
    uint32_t TRISJ13:1;
    uint32_t TRISJ14:1;
    uint32_t TRISJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISJbits_t;
extern volatile __TRISJbits_t TRISJbits __asm__ ("TRISJ") __attribute__((section("sfrs"), address(0xBF860810)));
extern volatile uint32_t        TRISJCLR __attribute__((section("sfrs"),address(0xBF860814)));
extern volatile uint32_t        TRISJSET __attribute__((section("sfrs"),address(0xBF860818)));
extern volatile uint32_t        TRISJINV __attribute__((section("sfrs"),address(0xBF86081C)));
#define PORTJ PORTJ
extern volatile uint32_t   PORTJ __attribute__((section("sfrs"), address(0xBF860820)));
typedef union {
  struct {
    uint32_t RJ0:1;
    uint32_t RJ1:1;
    uint32_t RJ2:1;
    uint32_t RJ3:1;
    uint32_t RJ4:1;
    uint32_t RJ5:1;
    uint32_t RJ6:1;
    uint32_t RJ7:1;
    uint32_t RJ8:1;
    uint32_t RJ9:1;
    uint32_t RJ10:1;
    uint32_t RJ11:1;
    uint32_t RJ12:1;
    uint32_t RJ13:1;
    uint32_t RJ14:1;
    uint32_t RJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTJbits_t;
extern volatile __PORTJbits_t PORTJbits __asm__ ("PORTJ") __attribute__((section("sfrs"), address(0xBF860820)));
extern volatile uint32_t        PORTJCLR __attribute__((section("sfrs"),address(0xBF860824)));
extern volatile uint32_t        PORTJSET __attribute__((section("sfrs"),address(0xBF860828)));
extern volatile uint32_t        PORTJINV __attribute__((section("sfrs"),address(0xBF86082C)));
#define LATJ LATJ
extern volatile uint32_t   LATJ __attribute__((section("sfrs"), address(0xBF860830)));
typedef union {
  struct {
    uint32_t LATJ0:1;
    uint32_t LATJ1:1;
    uint32_t LATJ2:1;
    uint32_t LATJ3:1;
    uint32_t LATJ4:1;
    uint32_t LATJ5:1;
    uint32_t LATJ6:1;
    uint32_t LATJ7:1;
    uint32_t LATJ8:1;
    uint32_t LATJ9:1;
    uint32_t LATJ10:1;
    uint32_t LATJ11:1;
    uint32_t LATJ12:1;
    uint32_t LATJ13:1;
    uint32_t LATJ14:1;
    uint32_t LATJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATJbits_t;
extern volatile __LATJbits_t LATJbits __asm__ ("LATJ") __attribute__((section("sfrs"), address(0xBF860830)));
extern volatile uint32_t        LATJCLR __attribute__((section("sfrs"),address(0xBF860834)));
extern volatile uint32_t        LATJSET __attribute__((section("sfrs"),address(0xBF860838)));
extern volatile uint32_t        LATJINV __attribute__((section("sfrs"),address(0xBF86083C)));
#define ODCJ ODCJ
extern volatile uint32_t   ODCJ __attribute__((section("sfrs"), address(0xBF860840)));
typedef union {
  struct {
    uint32_t ODCJ0:1;
    uint32_t ODCJ1:1;
    uint32_t ODCJ2:1;
    uint32_t ODCJ3:1;
    uint32_t ODCJ4:1;
    uint32_t ODCJ5:1;
    uint32_t ODCJ6:1;
    uint32_t ODCJ7:1;
    uint32_t ODCJ8:1;
    uint32_t ODCJ9:1;
    uint32_t ODCJ10:1;
    uint32_t ODCJ11:1;
    uint32_t ODCJ12:1;
    uint32_t ODCJ13:1;
    uint32_t ODCJ14:1;
    uint32_t ODCJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCJbits_t;
extern volatile __ODCJbits_t ODCJbits __asm__ ("ODCJ") __attribute__((section("sfrs"), address(0xBF860840)));
extern volatile uint32_t        ODCJCLR __attribute__((section("sfrs"),address(0xBF860844)));
extern volatile uint32_t        ODCJSET __attribute__((section("sfrs"),address(0xBF860848)));
extern volatile uint32_t        ODCJINV __attribute__((section("sfrs"),address(0xBF86084C)));
#define CNPUJ CNPUJ
extern volatile uint32_t   CNPUJ __attribute__((section("sfrs"), address(0xBF860850)));
typedef union {
  struct {
    uint32_t CNPUJ0:1;
    uint32_t CNPUJ1:1;
    uint32_t CNPUJ2:1;
    uint32_t CNPUJ3:1;
    uint32_t CNPUJ4:1;
    uint32_t CNPUJ5:1;
    uint32_t CNPUJ6:1;
    uint32_t CNPUJ7:1;
    uint32_t CNPUJ8:1;
    uint32_t CNPUJ9:1;
    uint32_t CNPUJ10:1;
    uint32_t CNPUJ11:1;
    uint32_t CNPUJ12:1;
    uint32_t CNPUJ13:1;
    uint32_t CNPUJ14:1;
    uint32_t CNPUJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUJbits_t;
extern volatile __CNPUJbits_t CNPUJbits __asm__ ("CNPUJ") __attribute__((section("sfrs"), address(0xBF860850)));
extern volatile uint32_t        CNPUJCLR __attribute__((section("sfrs"),address(0xBF860854)));
extern volatile uint32_t        CNPUJSET __attribute__((section("sfrs"),address(0xBF860858)));
extern volatile uint32_t        CNPUJINV __attribute__((section("sfrs"),address(0xBF86085C)));
#define CNPDJ CNPDJ
extern volatile uint32_t   CNPDJ __attribute__((section("sfrs"), address(0xBF860860)));
typedef union {
  struct {
    uint32_t CNPDJ0:1;
    uint32_t CNPDJ1:1;
    uint32_t CNPDJ2:1;
    uint32_t CNPDJ3:1;
    uint32_t CNPDJ4:1;
    uint32_t CNPDJ5:1;
    uint32_t CNPDJ6:1;
    uint32_t CNPDJ7:1;
    uint32_t CNPDJ8:1;
    uint32_t CNPDJ9:1;
    uint32_t CNPDJ10:1;
    uint32_t CNPDJ11:1;
    uint32_t CNPDJ12:1;
    uint32_t CNPDJ13:1;
    uint32_t CNPDJ14:1;
    uint32_t CNPDJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDJbits_t;
extern volatile __CNPDJbits_t CNPDJbits __asm__ ("CNPDJ") __attribute__((section("sfrs"), address(0xBF860860)));
extern volatile uint32_t        CNPDJCLR __attribute__((section("sfrs"),address(0xBF860864)));
extern volatile uint32_t        CNPDJSET __attribute__((section("sfrs"),address(0xBF860868)));
extern volatile uint32_t        CNPDJINV __attribute__((section("sfrs"),address(0xBF86086C)));
#define CNCONJ CNCONJ
extern volatile uint32_t   CNCONJ __attribute__((section("sfrs"), address(0xBF860870)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONJbits_t;
extern volatile __CNCONJbits_t CNCONJbits __asm__ ("CNCONJ") __attribute__((section("sfrs"), address(0xBF860870)));
extern volatile uint32_t        CNCONJCLR __attribute__((section("sfrs"),address(0xBF860874)));
extern volatile uint32_t        CNCONJSET __attribute__((section("sfrs"),address(0xBF860878)));
extern volatile uint32_t        CNCONJINV __attribute__((section("sfrs"),address(0xBF86087C)));
#define CNENJ CNENJ
extern volatile uint32_t   CNENJ __attribute__((section("sfrs"), address(0xBF860880)));
typedef union {
  struct {
    uint32_t CNIEJ0:1;
    uint32_t CNIEJ1:1;
    uint32_t CNIEJ2:1;
    uint32_t CNIEJ3:1;
    uint32_t CNIEJ4:1;
    uint32_t CNIEJ5:1;
    uint32_t CNIEJ6:1;
    uint32_t CNIEJ7:1;
    uint32_t CNIEJ8:1;
    uint32_t CNIEJ9:1;
    uint32_t CNIEJ10:1;
    uint32_t CNIEJ11:1;
    uint32_t CNIEJ12:1;
    uint32_t CNIEJ13:1;
    uint32_t CNIEJ14:1;
    uint32_t CNIEJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENJbits_t;
extern volatile __CNENJbits_t CNENJbits __asm__ ("CNENJ") __attribute__((section("sfrs"), address(0xBF860880)));
extern volatile uint32_t        CNENJCLR __attribute__((section("sfrs"),address(0xBF860884)));
extern volatile uint32_t        CNENJSET __attribute__((section("sfrs"),address(0xBF860888)));
extern volatile uint32_t        CNENJINV __attribute__((section("sfrs"),address(0xBF86088C)));
#define CNSTATJ CNSTATJ
extern volatile uint32_t   CNSTATJ __attribute__((section("sfrs"), address(0xBF860890)));
typedef union {
  struct {
    uint32_t CNSTATJ0:1;
    uint32_t CNSTATJ1:1;
    uint32_t CNSTATJ2:1;
    uint32_t CNSTATJ3:1;
    uint32_t CNSTATJ4:1;
    uint32_t CNSTATJ5:1;
    uint32_t CNSTATJ6:1;
    uint32_t CNSTATJ7:1;
    uint32_t CNSTATJ8:1;
    uint32_t CNSTATJ9:1;
    uint32_t CNSTATJ10:1;
    uint32_t CNSTATJ11:1;
    uint32_t CNSTATJ12:1;
    uint32_t CNSTATJ13:1;
    uint32_t CNSTATJ14:1;
    uint32_t CNSTATJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATJbits_t;
extern volatile __CNSTATJbits_t CNSTATJbits __asm__ ("CNSTATJ") __attribute__((section("sfrs"), address(0xBF860890)));
extern volatile uint32_t        CNSTATJCLR __attribute__((section("sfrs"),address(0xBF860894)));
extern volatile uint32_t        CNSTATJSET __attribute__((section("sfrs"),address(0xBF860898)));
extern volatile uint32_t        CNSTATJINV __attribute__((section("sfrs"),address(0xBF86089C)));
#define CNNEJ CNNEJ
extern volatile uint32_t   CNNEJ __attribute__((section("sfrs"), address(0xBF8608A0)));
typedef struct {
  uint32_t CNNEJ0:1;
  uint32_t CNNEJ1:1;
  uint32_t CNNEJ2:1;
  uint32_t CNNEJ3:1;
  uint32_t CNNEJ4:1;
  uint32_t CNNEJ5:1;
  uint32_t CNNEJ6:1;
  uint32_t CNNEJ7:1;
  uint32_t CNNEJ8:1;
  uint32_t CNNEJ9:1;
  uint32_t CNNEJ10:1;
  uint32_t CNNEJ11:1;
  uint32_t CNNEJ12:1;
  uint32_t CNNEJ13:1;
  uint32_t CNNEJ14:1;
  uint32_t CNNEJ15:1;
} __CNNEJbits_t;
extern volatile __CNNEJbits_t CNNEJbits __asm__ ("CNNEJ") __attribute__((section("sfrs"), address(0xBF8608A0)));
extern volatile uint32_t        CNNEJCLR __attribute__((section("sfrs"),address(0xBF8608A4)));
extern volatile uint32_t        CNNEJSET __attribute__((section("sfrs"),address(0xBF8608A8)));
extern volatile uint32_t        CNNEJINV __attribute__((section("sfrs"),address(0xBF8608AC)));
#define CNFJ CNFJ
extern volatile uint32_t   CNFJ __attribute__((section("sfrs"), address(0xBF8608B0)));
typedef struct {
  uint32_t CNFJ0:1;
  uint32_t CNFJ1:1;
  uint32_t CNFJ2:1;
  uint32_t CNFJ3:1;
  uint32_t CNFJ4:1;
  uint32_t CNFJ5:1;
  uint32_t CNFJ6:1;
  uint32_t CNFJ7:1;
  uint32_t CNFJ8:1;
  uint32_t CNFJ9:1;
  uint32_t CNFJ10:1;
  uint32_t CNFJ11:1;
  uint32_t CNFJ12:1;
  uint32_t CNFJ13:1;
  uint32_t CNFJ14:1;
  uint32_t CNFJ15:1;
} __CNFJbits_t;
extern volatile __CNFJbits_t CNFJbits __asm__ ("CNFJ") __attribute__((section("sfrs"), address(0xBF8608B0)));
extern volatile uint32_t        CNFJCLR __attribute__((section("sfrs"),address(0xBF8608B4)));
extern volatile uint32_t        CNFJSET __attribute__((section("sfrs"),address(0xBF8608B8)));
extern volatile uint32_t        CNFJINV __attribute__((section("sfrs"),address(0xBF8608BC)));
#define SRCON0J SRCON0J
extern volatile uint32_t   SRCON0J __attribute__((section("sfrs"), address(0xBF8608C0)));
typedef struct {
  uint32_t SR0J0:1;
  uint32_t SR0J1:1;
  uint32_t SR0J2:1;
  uint32_t SR0J3:1;
  uint32_t SR0J4:1;
  uint32_t SR0J5:1;
  uint32_t SR0J6:1;
  uint32_t SR0J7:1;
  uint32_t SR0J8:1;
  uint32_t SR0J9:1;
  uint32_t SR0J10:1;
  uint32_t SR0J11:1;
  uint32_t SR0J12:1;
  uint32_t SR0J13:1;
  uint32_t SR0J14:1;
  uint32_t SR0J15:1;
} __SRCON0Jbits_t;
extern volatile __SRCON0Jbits_t SRCON0Jbits __asm__ ("SRCON0J") __attribute__((section("sfrs"), address(0xBF8608C0)));
extern volatile uint32_t        SRCON0JCLR __attribute__((section("sfrs"),address(0xBF8608C4)));
extern volatile uint32_t        SRCON0JSET __attribute__((section("sfrs"),address(0xBF8608C8)));
extern volatile uint32_t        SRCON0JINV __attribute__((section("sfrs"),address(0xBF8608CC)));
#define SRCON1J SRCON1J
extern volatile uint32_t   SRCON1J __attribute__((section("sfrs"), address(0xBF8608D0)));
typedef struct {
  uint32_t SR1J0:1;
  uint32_t SR1J1:1;
  uint32_t SR1J2:1;
  uint32_t SR1J3:1;
  uint32_t SR1J4:1;
  uint32_t SR1J5:1;
  uint32_t SR1J6:1;
  uint32_t SR1J7:1;
  uint32_t SR1J8:1;
  uint32_t SR1J9:1;
  uint32_t SR1J10:1;
  uint32_t SR1J11:1;
  uint32_t SR1J12:1;
  uint32_t SR1J13:1;
  uint32_t SR1J14:1;
  uint32_t SR1J15:1;
} __SRCON1Jbits_t;
extern volatile __SRCON1Jbits_t SRCON1Jbits __asm__ ("SRCON1J") __attribute__((section("sfrs"), address(0xBF8608D0)));
extern volatile uint32_t        SRCON1JCLR __attribute__((section("sfrs"),address(0xBF8608D4)));
extern volatile uint32_t        SRCON1JSET __attribute__((section("sfrs"),address(0xBF8608D8)));
extern volatile uint32_t        SRCON1JINV __attribute__((section("sfrs"),address(0xBF8608DC)));
#define ANSELK ANSELK
extern volatile uint32_t   ANSELK __attribute__((section("sfrs"), address(0xBF860900)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t ANSK1:1;
    uint32_t ANSK2:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELKbits_t;
extern volatile __ANSELKbits_t ANSELKbits __asm__ ("ANSELK") __attribute__((section("sfrs"), address(0xBF860900)));
extern volatile uint32_t        ANSELKCLR __attribute__((section("sfrs"),address(0xBF860904)));
extern volatile uint32_t        ANSELKSET __attribute__((section("sfrs"),address(0xBF860908)));
extern volatile uint32_t        ANSELKINV __attribute__((section("sfrs"),address(0xBF86090C)));
#define TRISK TRISK
extern volatile uint32_t   TRISK __attribute__((section("sfrs"), address(0xBF860910)));
typedef union {
  struct {
    uint32_t TRISK0:1;
    uint32_t TRISK1:1;
    uint32_t TRISK2:1;
    uint32_t TRISK3:1;
    uint32_t TRISK4:1;
    uint32_t TRISK5:1;
    uint32_t TRISK6:1;
    uint32_t TRISK7:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISKbits_t;
