Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz1064dar169.h
extern volatile __DSGPR21bits_t DSGPR21bits __asm__ ("DSGPR21") __attribute__((section("sfrs"), address(0xBF8C0290)));
#define DSGPR22 DSGPR22
extern volatile uint32_t   DSGPR22 __attribute__((section("sfrs"), address(0xBF8C0294)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR22bits_t;
extern volatile __DSGPR22bits_t DSGPR22bits __asm__ ("DSGPR22") __attribute__((section("sfrs"), address(0xBF8C0294)));
#define DSGPR23 DSGPR23
extern volatile uint32_t   DSGPR23 __attribute__((section("sfrs"), address(0xBF8C0298)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR23bits_t;
extern volatile __DSGPR23bits_t DSGPR23bits __asm__ ("DSGPR23") __attribute__((section("sfrs"), address(0xBF8C0298)));
#define DSGPR24 DSGPR24
extern volatile uint32_t   DSGPR24 __attribute__((section("sfrs"), address(0xBF8C029C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR24bits_t;
extern volatile __DSGPR24bits_t DSGPR24bits __asm__ ("DSGPR24") __attribute__((section("sfrs"), address(0xBF8C029C)));
#define DSGPR25 DSGPR25
extern volatile uint32_t   DSGPR25 __attribute__((section("sfrs"), address(0xBF8C02A0)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR25bits_t;
extern volatile __DSGPR25bits_t DSGPR25bits __asm__ ("DSGPR25") __attribute__((section("sfrs"), address(0xBF8C02A0)));
#define DSGPR26 DSGPR26
extern volatile uint32_t   DSGPR26 __attribute__((section("sfrs"), address(0xBF8C02A4)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR26bits_t;
extern volatile __DSGPR26bits_t DSGPR26bits __asm__ ("DSGPR26") __attribute__((section("sfrs"), address(0xBF8C02A4)));
#define DSGPR27 DSGPR27
extern volatile uint32_t   DSGPR27 __attribute__((section("sfrs"), address(0xBF8C02A8)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR27bits_t;
extern volatile __DSGPR27bits_t DSGPR27bits __asm__ ("DSGPR27") __attribute__((section("sfrs"), address(0xBF8C02A8)));
#define DSGPR28 DSGPR28
extern volatile uint32_t   DSGPR28 __attribute__((section("sfrs"), address(0xBF8C02AC)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR28bits_t;
extern volatile __DSGPR28bits_t DSGPR28bits __asm__ ("DSGPR28") __attribute__((section("sfrs"), address(0xBF8C02AC)));
#define DSGPR29 DSGPR29
extern volatile uint32_t   DSGPR29 __attribute__((section("sfrs"), address(0xBF8C02B0)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR29bits_t;
extern volatile __DSGPR29bits_t DSGPR29bits __asm__ ("DSGPR29") __attribute__((section("sfrs"), address(0xBF8C02B0)));
#define DSGPR30 DSGPR30
extern volatile uint32_t   DSGPR30 __attribute__((section("sfrs"), address(0xBF8C02B4)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR30bits_t;
extern volatile __DSGPR30bits_t DSGPR30bits __asm__ ("DSGPR30") __attribute__((section("sfrs"), address(0xBF8C02B4)));
#define DSGPR31 DSGPR31
extern volatile uint32_t   DSGPR31 __attribute__((section("sfrs"), address(0xBF8C02B8)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR31bits_t;
extern volatile __DSGPR31bits_t DSGPR31bits __asm__ ("DSGPR31") __attribute__((section("sfrs"), address(0xBF8C02B8)));
#define DSGPR32 DSGPR32
extern volatile uint32_t   DSGPR32 __attribute__((section("sfrs"), address(0xBF8C02BC)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR32bits_t;
extern volatile __DSGPR32bits_t DSGPR32bits __asm__ ("DSGPR32") __attribute__((section("sfrs"), address(0xBF8C02BC)));
#define PRECON PRECON
extern volatile uint32_t   PRECON __attribute__((section("sfrs"), address(0xBF8E0000)));
typedef struct {
  uint32_t PFMWS:3;
  uint32_t :1;
  uint32_t PREFEN:2;
  uint32_t :20;
  uint32_t PFMSECEN:1;
} __PRECONbits_t;
extern volatile __PRECONbits_t PRECONbits __asm__ ("PRECON") __attribute__((section("sfrs"), address(0xBF8E0000)));
extern volatile uint32_t        PRECONCLR __attribute__((section("sfrs"),address(0xBF8E0004)));
extern volatile uint32_t        PRECONSET __attribute__((section("sfrs"),address(0xBF8E0008)));
extern volatile uint32_t        PRECONINV __attribute__((section("sfrs"),address(0xBF8E000C)));
#define PRESTAT PRESTAT
extern volatile uint32_t   PRESTAT __attribute__((section("sfrs"), address(0xBF8E0010)));
typedef struct {
  uint32_t PFMSECCNT:8;
  uint32_t :18;
  uint32_t PFMSEC:1;
  uint32_t PFMDED:1;
} __PRESTATbits_t;
extern volatile __PRESTATbits_t PRESTATbits __asm__ ("PRESTAT") __attribute__((section("sfrs"), address(0xBF8E0010)));
extern volatile uint32_t        PRESTATCLR __attribute__((section("sfrs"),address(0xBF8E0014)));
extern volatile uint32_t        PRESTATSET __attribute__((section("sfrs"),address(0xBF8E0018)));
extern volatile uint32_t        PRESTATINV __attribute__((section("sfrs"),address(0xBF8E001C)));
#define EBICS0 EBICS0
extern volatile uint32_t   EBICS0 __attribute__((section("sfrs"), address(0xBF8E1014)));
typedef struct {
  uint32_t :16;
  uint32_t CSADDR:16;
} __EBICS0bits_t;
extern volatile __EBICS0bits_t EBICS0bits __asm__ ("EBICS0") __attribute__((section("sfrs"), address(0xBF8E1014)));
#define EBICS1 EBICS1
extern volatile uint32_t   EBICS1 __attribute__((section("sfrs"), address(0xBF8E1018)));
typedef struct {
  uint32_t :16;
  uint32_t CSADDR:16;
} __EBICS1bits_t;
extern volatile __EBICS1bits_t EBICS1bits __asm__ ("EBICS1") __attribute__((section("sfrs"), address(0xBF8E1018)));
#define EBICS2 EBICS2
extern volatile uint32_t   EBICS2 __attribute__((section("sfrs"), address(0xBF8E101C)));
typedef struct {
  uint32_t :16;
  uint32_t CSADDR:16;
} __EBICS2bits_t;
extern volatile __EBICS2bits_t EBICS2bits __asm__ ("EBICS2") __attribute__((section("sfrs"), address(0xBF8E101C)));
#define EBICS3 EBICS3
extern volatile uint32_t   EBICS3 __attribute__((section("sfrs"), address(0xBF8E1020)));
typedef struct {
  uint32_t :16;
  uint32_t CSADDR:16;
} __EBICS3bits_t;
extern volatile __EBICS3bits_t EBICS3bits __asm__ ("EBICS3") __attribute__((section("sfrs"), address(0xBF8E1020)));
#define EBIMSK0 EBIMSK0
extern volatile uint32_t   EBIMSK0 __attribute__((section("sfrs"), address(0xBF8E1054)));
typedef struct {
  uint32_t MEMSIZE:5;
  uint32_t MEMTYPE:3;
  uint32_t REGSEL:3;
} __EBIMSK0bits_t;
